SEK-Based/SwedenSoap3.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://swea.riksbank.se/xsd">
  <soap:Header />
  <soap:Body>
    <xsd:getCrossRates>
      <crossRequestParameters>
        <aggregateMethod>D</aggregateMethod>
        <!--1 or more repetitions:-->
        <crossPair>
          <seriesid1>SEKUSDPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKGBPPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKEURPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKCHFPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKAUDPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKBRLPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKCADPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKCNYPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKDKKPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKHKDPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKIDRPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKINRPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKISKPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKJPYPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKKRWPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKKWDPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKMADPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKMXNPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKMYRPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKNOKPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKNZDPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKRUBPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKSARPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKSGDPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKTHBPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKTRLPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <crossPair>
          <seriesid1>SEKZARPMI</seriesid1>
          <seriesid2>SEK</seriesid2>
        </crossPair>
        <!-- BOB not among the currencies.... as expected -->
        <!-- No error message whatsoever -->
        <!-- <crossPair>
               <seriesid1>SEKBOBPMI</seriesid1>
               <seriesid2>SEK</seriesid2>
            </crossPair> -->
        <datefrom>2018-08-21</datefrom>
        <dateto>2018-08-22</dateto>
        <languageid>en</languageid>
      </crossRequestParameters>
    </xsd:getCrossRates>
  </soap:Body>
</soap:Envelope>