anyfin-platform/platform-composer/dags/utils/message.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://swea.riksbank.se/xsd">
	<soap:Header/>
	<soap:Body>
		<xsd:getMonthlyAverageExchangeRates>
			<year>2022</year>
			<month>4</month>
			<languageid>en</languageid>
		</xsd:getMonthlyAverageExchangeRates>
	</soap:Body>
</soap:Envelope>