api/swea/requests/get_calendar_days.xml

<soap:Envelope
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:xsd="http://swea.riksbank.se/xsd">
    <soap:Header/>
    <soap:Body>
        <xsd:getCalendarDays>
            <datefrom>{{fmtDate .From}}</datefrom>
            <dateto>{{fmtDate .To}}</dateto>
        </xsd:getCalendarDays>
    </soap:Body>
</soap:Envelope>
