swea/requests/get_interest_and_exchange_group_names.xml

<soap:Envelope
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:xsd="http://swea.riksbank.se/xsd">
    <soap:Header/>
    <soap:Body>
        <xsd:getInterestAndExchangeGroupNames>
            <languageid>{{ .Language }}</languageid>
        </xsd:getInterestAndExchangeGroupNames>
    </soap:Body>
</soap:Envelope>
