.insomnia/Request/req_37151b6599fb43acb2d50c3e444b7830.yml

_id: req_37151b6599fb43acb2d50c3e444b7830
type: Request
parentId: fld_998b1138e7f84425b6ccfdcb83aa7df1
modified: 1643714690378
created: 1642969319184
url: http://swea.riksbank.se/sweaWS/services/SweaWebServiceHttpSoap12Endpoint
name: getInterestAndExchangeGroupNames
description: ""
method: POST
body:
  mimeType: application/xml
  text: >-
    <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:xsd="http://swea.riksbank.se/xsd">
    	<soap:Header/>
    	<soap:Body>
    		<xsd:getInterestAndExchangeGroupNames>
    			<languageid>sv</languageid>
    		</xsd:getInterestAndExchangeGroupNames>
    	</soap:Body>
    </soap:Envelope>
parameters: []
headers:
  - name: Content-Type
    value: application/soap+xml
    id: pair_7556acb783854b7b89d486941c4596e5
  - id: pair_6658b2c4347e475ab3261b2d6d0e47bf
    name: charset
    value: utf-8
    description: ""
  - id: pair_53d66ee1d9a546b5b11aee83bf082d94
    name: action
    value: urn:{% request 'name', '', 0 %}
    description: ""
authentication: {}
metaSortKey: -1642729038969
isPrivate: false
settingStoreCookies: true
settingSendCookies: true
settingDisableRenderRequestBody: false
settingEncodeUrl: true
settingRebuildPath: true
settingFollowRedirects: global
