.insomnia/Request/req_0f54b9077f124f8aafbee6c80d7c3c23.yml

_id: req_0f54b9077f124f8aafbee6c80d7c3c23
type: Request
parentId: fld_998b1138e7f84425b6ccfdcb83aa7df1
modified: 1643714699791
created: 1642605626128
url: http://swea.riksbank.se/sweaWS/services/SweaWebServiceHttpSoap12Endpoint
name: getMonthlyAverageExchangeRates
description: ""
method: POST
body:
  mimeType: application/xml
  text: >-
    <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:xsd="http://swea.riksbank.se/xsd">
    	<soap:Header/>
    	<soap:Body>
    		<xsd:getMonthlyAverageExchangeRates>
    			<year>2011</year>
    			<month>3</month>
    			<languageid>en</languageid>
    		</xsd:getMonthlyAverageExchangeRates>
    	</soap:Body>
    </soap:Envelope>
parameters: []
headers:
  - name: Content-Type
    value: application/soap+xml
    id: pair_7556acb783854b7b89d486941c4596e5
  - id: pair_6658b2c4347e475ab3261b2d6d0e47bf
    name: charset
    value: utf-8
    description: ""
  - id: pair_c1ef31c0faff450fa536f29bf87ac86a
    name: action
    value: urn:getCalendarDays
    description: ""
authentication: {}
metaSortKey: -1642729039069
isPrivate: false
settingStoreCookies: true
settingSendCookies: true
settingDisableRenderRequestBody: false
settingEncodeUrl: true
settingRebuildPath: true
settingFollowRedirects: global
