.insomnia/Request/req_ab030c9292f54ab3a6bb0e84a17afbcb.yml

_id: req_ab030c9292f54ab3a6bb0e84a17afbcb
type: Request
parentId: wrk_391b8028a0de41a5be22178885dae724
modified: 1642607309512
created: 1642605841946
url: http://swea.riksbank.se/sweaWS/services/SweaWebServiceHttpSoap12Endpoint
name: getInterestAndExchangeNames
description: ""
method: POST
body:
  mimeType: application/xml
  text: >-
    <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:xsd="http://swea.riksbank.se/xsd">
    	<soap:Header/>
    	<soap:Body>
    		<xsd:getInterestAndExchangeNames>
    			<groupid>5</groupid>
    			<languageid>sv</languageid>
    		</xsd:getInterestAndExchangeNames>
    	</soap:Body>
    </soap:Envelope>
parameters: []
headers:
  - name: Content-Type
    value: application/soap+xml
    id: pair_7556acb783854b7b89d486941c4596e5
  - id: pair_6658b2c4347e475ab3261b2d6d0e47bf
    name: charset
    value: utf-8
    description: ""
  - id: pair_53d66ee1d9a546b5b11aee83bf082d94
    name: action
    value: urn:{% request 'name', '', 0 %}
    description: ""
authentication: {}
metaSortKey: -1641743421368.5
isPrivate: false
settingStoreCookies: true
settingSendCookies: true
settingDisableRenderRequestBody: false
settingEncodeUrl: true
settingRebuildPath: true
settingFollowRedirects: global
